Revit 2026 API

# IFCPropertyMappingInfo Methods

---

The IFCPropertyMappingInfo type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | IsValidMappingInfo | Defines whether the mapping info contains meaningful data. |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

IFCPropertyMappingInfo Class

Autodesk.Revit.DB Namespace